wjblanke/UnoCart-2600/source/STM32firmware/Atari2600Cart/src/main.c
int identify_cartridge(char *filename, char* long_filename)
{
	TM_DELAY_Init();
	FATFS FatFs;
	unsigned int image_size;
	int cart_type = CART_TYPE_NONE;
	FIL fil;

	if (f_mount(&FatFs, "", 1) != FR_OK) return CART_TYPE_NONE;
	if (f_open(&fil, filename, FA_READ) != FR_OK) goto unmount;

	// select type by file extension?
	char *ext = get_filename_ext(long_filename);
	EXT_TO_CART_TYPE_MAP *p = ext_to_cart_type_map;
	while (p->ext) {
		if (strcasecmp(ext, p->ext) == 0) {
			cart_type = p->cart_type;
			break;
		}
		p++;
	}

	image_size = f_size(&fil);

	// Supercharger cartridges get special treatment, since we don't load the entire
	// file into the buffer here
	if (cart_type == CART_TYPE_NONE && (image_size % 8448) == 0)
		cart_type = CART_TYPE_AR;
	if (cart_type == CART_TYPE_AR) goto close;

	// otherwise, read the file into the cartridge buffer
	unsigned int bytes_to_read = image_size > (BUFFER_SIZE * 1024) ? (BUFFER_SIZE * 1024) : image_size;
	UINT bytes_read;
	FRESULT read_result = f_read(&fil, buffer, bytes_to_read, &bytes_read);

	if (read_result != FR_OK || bytes_to_read != bytes_read) {
		cart_type = CART_TYPE_NONE;
		goto close;
	}

	uint8_t tail[16];
	if (f_lseek(&fil, image_size - 16) != FR_OK) {
		cart_type = CART_TYPE_NONE;
		goto close;
	}

	UINT bytes_read_tail;
	read_result = f_read(&fil, tail, 16, &bytes_read_tail);
	if (read_result != FR_OK || 16 != bytes_read_tail) {
		cart_type = CART_TYPE_NONE;
		goto close;
	}

	if (cart_type != CART_TYPE_NONE) goto close;

	// If we don't already know the type (from the file extension), then we
	// auto-detect the cart type - largely follows code in Stella's CartDetector.cpp

	if (is_ace_cartridge(bytes_read, buffer))
	{
		cart_type = CART_TYPE_ACE;
	}
	else if (image_size <= 64 * 1024 && (image_size % 1024) == 0 && isProbably3EPlus(image_size, buffer))
	{
		cart_type = CART_TYPE_3EP;
	}
	else if (image_size == 2*1024)
	{
		if (isProbablyCV(bytes_read, buffer))
			cart_type = CART_TYPE_CV;
		else
			cart_type = CART_TYPE_2K;
	}
	else if (image_size == 4*1024)
	{
		cart_type = isProbably4KSC(buffer) ? CART_TYPE_4KSC : CART_TYPE_4K;
	}
	else if (image_size == 8*1024)
	{
		// First check for *potential* F8
		unsigned char  signature[] = { 0x8D, 0xF9, 0x1F };  // STA $1FF9
		int f8 = searchForBytes(buffer, bytes_read, signature, 3, 2);

		if (isProbablySC(bytes_read, buffer))
			cart_type = CART_TYPE_F8SC;
		else if (memcmp(buffer, buffer + 4096, 4096) == 0)
			cart_type = CART_TYPE_4K;
		else if (isProbablyE0(bytes_read, buffer))
			cart_type = CART_TYPE_E0;
		else if (isProbably3E(bytes_read, buffer))
			cart_type = CART_TYPE_3E;
		else if (isProbably3F(bytes_read, buffer))
			cart_type = CART_TYPE_3F;
		else if (isProbablyFE(bytes_read, buffer) && !f8)
			cart_type = CART_TYPE_FE;
		else if (isProbably0840(bytes_read, buffer))
			cart_type = CART_TYPE_0840;
		else {
			cart_type = CART_TYPE_F8;
		}
	}
	else if (image_size == 8*1024 + 3) {
		cart_type = CART_TYPE_PP;
	}
	else if(image_size >= 10240 && image_size <= 10496)
	{  // ~10K - Pitfall II
		cart_type = CART_TYPE_DPC;
	}
	else if (image_size == 12*1024)
	{
		cart_type = CART_TYPE_FA;
	}
	else if (image_size == 16*1024)
	{
		if (isProbablySC(bytes_read, buffer))
			cart_type = CART_TYPE_F6SC;
		else if (isProbablyE7(bytes_read, buffer))
			cart_type = CART_TYPE_E7;
		else if (isProbably3E(bytes_read, buffer))
			cart_type = CART_TYPE_3E;
		else
			cart_type = CART_TYPE_F6;
	}
	else if (image_size == 32*1024)
	{
		if (isProbablySC(bytes_read, buffer))
			cart_type = CART_TYPE_F4SC;
		else if (isProbably3E(bytes_read, buffer))
			cart_type = CART_TYPE_3E;
		else if (isProbably3F(bytes_read, buffer))
			cart_type = CART_TYPE_3F;
		else
			cart_type = CART_TYPE_F4;
	}
	else if (image_size == 64*1024)
	{
		if (isProbably3E(bytes_read, buffer))
			cart_type = CART_TYPE_3E;
		else if (isProbably3F(bytes_read, buffer))
			cart_type = CART_TYPE_3F;
		else if (isProbablyEF(bytes_read, buffer))
		{
			if (isProbablySC(bytes_read, buffer))
				cart_type = CART_TYPE_EFSC;
			else
				cart_type = CART_TYPE_EF;
		}
		else
			cart_type = CART_TYPE_F0;
	}
	else if (image_size == 128 * 1024) {
		if (isProbablyDF(tail))
			cart_type = CART_TYPE_DF;
		else if (isProbablyDFSC(tail))
			cart_type = CART_TYPE_DFSC;
	}
	else if (image_size == 256 * 1024)
	{
		if (isProbablyBF(tail))
			cart_type = CART_TYPE_BF;
		else if (isProbablyBFSC(tail))
			cart_type = CART_TYPE_BFSC;
	}

	close:
		f_close(&fil);

	unmount:
		f_mount(0, "", 1);

	if (cart_type)
		cart_size_bytes = image_size;

	return cart_type;
}

/*************************************************************************
 * MCU Initialisation
 *************************************************************************/

GPIO_InitTypeDef  GPIO_InitStructure;

/* Input/Output data GPIO pins on PD{8..15} */
void config_gpio_data(void) {
	/* GPIOD Periph clock enable */
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);

	/* Configure GPIO Settings */
	GPIO_InitStructure.GPIO_Pin =
		GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 | GPIO_Pin_11 |
		GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_25MHz;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_Init(GPIOD, &GPIO_InitStructure);
}

/* Input Address GPIO pins on PE{0..15} (A0-A12 on PE0-PE12) */
void config_gpio_addr(void) {
	/* GPIOE Periph clock enable */
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, ENABLE);

	/* Configure GPIO Settings */
	GPIO_InitStructure.GPIO_Pin =
		GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3 |
		GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7 |
		GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 | GPIO_Pin_11 |
		GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_DOWN;
	GPIO_Init(GPIOE, &GPIO_InitStructure);
}

/* Input Signals GPIO pins - PC0, PC1 (PC0=0 PAL60, PC1=0 PAL) */
void config_gpio_sig(void) {
	/* GPIOC Periph clock enable */
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);

	/* Configure GPIO Settings */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_25MHz;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_Init(GPIOC, &GPIO_InitStructure);
}

/*************************************************************************
 * Cartridge Emulation
 *************************************************************************/

