wjblanke/UnoCart-2600/source/STM32firmware/Atari2600Cart/src/main.c
	__disable_irq();	// Disable interrupts
	uint16_t addr, addr_prev = 0, data = 0, data_prev = 0;

	while (1)
	{
		while ((addr = ADDR_IN) != addr_prev)
			addr_prev = addr;
		// got a stable address
		if (addr & 0x1000)
		{ // A12 high
			if (addr & 0x0800)
			{	// ROM read
				DATA_OUT = ((uint16_t)cart_rom[addr&0x7FF])<<8;
				SET_DATA_MODE_OUT
				// wait for address bus to change
				while (ADDR_IN == addr) ;
				SET_DATA_MODE_IN
			}
			else
			{	// RAM access
				if (addr & 0x0400)
				{	// a write to cartridge ram
					// read last data on the bus before the address lines change
					while (ADDR_IN == addr) { data_prev = data; data = DATA_IN; }
					cart_ram[addr&0x3FF] = data_prev>>8;
				}
				else
				{	// a read from cartridge ram
					DATA_OUT = ((uint16_t)cart_ram[addr&0x3FF])<<8;
					SET_DATA_MODE_OUT
					// wait for address bus to change
					while (ADDR_IN == addr) ;
					SET_DATA_MODE_IN
				}
			}
		}
	}
	__enable_irq();
}

/* F0 Bankswitching
 * ------------------------------
 * 64K cartridge with 16 x 4K banks. An access to $1FF0 switches to the next
 * bank in sequence.
 */
void emulate_F0_cartridge()
{
	setup_cartridge_image();

	__disable_irq();	// Disable interrupts
	uint16_t addr, addr_prev = 0;
	int currentBank = 0;

	while (1)
	{
		while ((addr = ADDR_IN) != addr_prev)
			addr_prev = addr;
		// got a stable address
		if (addr & 0x1000)
		{ // A12 high
			if (addr == 0x1FF0)
				currentBank = (currentBank + 1) % 16;
			// ROM access
			DATA_OUT = ((uint16_t)cart_rom[(currentBank * 4096)+(addr&0xFFF)])<<8;
			SET_DATA_MODE_OUT
			// wait for address bus to change
			while (ADDR_IN == addr) ;
			SET_DATA_MODE_IN
		}
	}
	__enable_irq();
}

/* E7 Bankswitching
 * ------------------------------
 * 16K cartridge with additional RAM.
 * The text below is the best description of the mapping scheme I could find,
 * quoted from http://blog.kevtris.org/blogfiles/Atari%202600%20Mappers.txt
 */

/*
M-network wanted something of their own too, so they came up with what they called
"Big Game" (this was printed on the prototype ASICs on the prototype carts).  It
can handle up to 16K of ROM and 2K of RAM.

1000-17FF is selectable
1800-19FF is RAM
1A00-1FFF is fixed to the last 1.5K of ROM

Accessing 1FE0 through 1FE6 selects bank 0 through bank 6 of the ROM into 1000-17FF.
Accessing 1FE7 enables 1K of the 2K RAM, instead.

When the RAM is enabled, this 1K appears at 1000-17FF.  1000-13FF is the write port, 1400-17FF
is the read port.

1800-19FF also holds RAM. 1800-18FF is the write port, 1900-19FF is the read port.
Only 256 bytes of RAM is accessable at time, but there are four different 256 byte
banks making a total of 1K accessable here.

Accessing 1FE8 through 1FEB select which 256 byte bank shows up.
 */
void emulate_E7_cartridge()
{
	setup_cartridge_image_with_ram();

	__disable_irq();	// Disable interrupts
	uint16_t addr, addr_prev = 0, data = 0, data_prev = 0;
	unsigned char *bankPtr = &cart_rom[0];
	unsigned char *fixedPtr = &cart_rom[(8-1)*2048];
	unsigned char *ram1Ptr = &cart_ram[0];
	unsigned char *ram2Ptr = &cart_ram[1024];
	int ram_mode = 0;

	while (1)
	{
		while ((addr = ADDR_IN) != addr_prev)
			addr_prev = addr;
		// got a stable address
		if (addr & 0x1000)
		{ // A12 high
			if (addr & 0x0800)
			{	// higher 2k cartridge ROM area
				if ((addr & 0x0E00) == 0x0800)
				{	// 256 byte RAM access
					if (addr & 0x0100)
					{	// 1900-19FF is the read port
						DATA_OUT = ((uint16_t)ram1Ptr[addr&0xFF])<<8;
						SET_DATA_MODE_OUT
						// wait for address bus to change
						while (ADDR_IN == addr) ;
						SET_DATA_MODE_IN
					}
					else
					{	// 1800-18FF is the write port
						while (ADDR_IN == addr) { data_prev = data; data = DATA_IN; }
						ram1Ptr[addr&0xFF] = data_prev>>8;
					}
				}
				else
				{	// fixed ROM bank access
					// check bankswitching addresses
					if (addr >= 0x1FE0 && addr <= 0x1FE7)
					{
						if (addr == 0x1FE7) ram_mode = 1;
						else
						{
							bankPtr = &cart_rom[(addr - 0x1FE0)*2048];
							ram_mode = 0;
						}
					}
					else if (addr >= 0x1FE8 && addr <= 0x1FEB)
						ram1Ptr = &cart_ram[(addr - 0x1FE8)*256];

					DATA_OUT = ((uint16_t)fixedPtr[addr&0x7FF])<<8;
					SET_DATA_MODE_OUT
					// wait for address bus to change
					while (ADDR_IN == addr) ;
					SET_DATA_MODE_IN
				}
			}
			else
			{	// lower 2k cartridge ROM area
				if (ram_mode)
				{	// 1K RAM access
					if (addr & 0x400)
					{	// 1400-17FF is the read port
						DATA_OUT = ((uint16_t)ram2Ptr[addr&0x3FF])<<8;
						SET_DATA_MODE_OUT
						// wait for address bus to change
						while (ADDR_IN == addr) ;
						SET_DATA_MODE_IN
					}
					else
					{	// 1000-13FF is the write port
						while (ADDR_IN == addr) { data_prev = data; data = DATA_IN; }
						ram2Ptr[addr&0x3FF] = data_prev>>8;
					}
				}
				else
				{	// selected ROM bank access
					DATA_OUT = ((uint16_t)bankPtr[addr&0x7FF])<<8;
					SET_DATA_MODE_OUT
					// wait for address bus to change
					while (ADDR_IN == addr) ;
					SET_DATA_MODE_IN
				}
			}
		}
	}
	__enable_irq();
}

/* DPC (Pitfall II) Bankswitching
 * ------------------------------
 * Bankswitching like F8(8k)
 * DPC implementation based on:
 * - Stella (https://github.com/stella-emu) - CartDPC.cxx
 * - Kevin Horton's 2600 Mappers (http://blog.kevtris.org/blogfiles/Atari 2600 Mappers.txt)
 *
 * Note this is not a full implementation of DPC, but is enough to run Pitfall II and the music sounds ok.
 */

/*************************************************************************
 * Main loop/helper functions
 *************************************************************************/

void emulate_cartridge(int cart_type)
{
	if (cart_type == CART_TYPE_2K)
		emulate_2k_cartridge();
	else if (cart_type == CART_TYPE_4K)
		emulate_4k_cartridge();
	else if (cart_type == CART_TYPE_4KSC)
		emulate_4ksc_cartridge();
	else if (cart_type == CART_TYPE_F8)
		emulate_FxSC_cartridge(0x1FF8, 0x1FF9, 0);
	else if (cart_type == CART_TYPE_F6)
		emulate_FxSC_cartridge(0x1FF6, 0x1FF9, 0);
	else if (cart_type == CART_TYPE_F4)
		emulate_FxSC_cartridge(0x1FF4, 0x1FFB, 0);
	else if (cart_type == CART_TYPE_F8SC)
		emulate_FxSC_cartridge(0x1FF8, 0x1FF9, 1);
	else if (cart_type == CART_TYPE_F6SC)
		emulate_FxSC_cartridge(0x1FF6, 0x1FF9, 1);
	else if (cart_type == CART_TYPE_F4SC)
		emulate_FxSC_cartridge(0x1FF4, 0x1FFB, 1);
	else if (cart_type == CART_TYPE_FE)
		emulate_FE_cartridge();
	else if (cart_type == CART_TYPE_3F)
		emulate_3f_cartridge(cartridge_image_path, cart_size_bytes, buffer);
	else if (cart_type == CART_TYPE_3E)
		emulate_3e_cartridge(cartridge_image_path, cart_size_bytes, buffer, 32);
	else if (cart_type == CART_TYPE_3EX)
		emulate_3e_cartridge(cartridge_image_path, cart_size_bytes, buffer, BUFFER_SIZE);
	else if (cart_type == CART_TYPE_E0)
		emulate_E0_cartridge();
	else if (cart_type == CART_TYPE_0840)
		emulate_0840_cartridge();
	else if (cart_type == CART_TYPE_CV)
		emulate_CV_cartridge();
	else if (cart_type == CART_TYPE_EF)
		emulate_FxSC_cartridge(0x1FE0, 0x1FEF, 0);
	else if (cart_type == CART_TYPE_EFSC)
		emulate_FxSC_cartridge(0x1FE0, 0x1FEF, 1);
	else if (cart_type == CART_TYPE_F0)
		emulate_F0_cartridge();
	else if (cart_type == CART_TYPE_FA)
		emulate_FA_cartridge();
	else if (cart_type == CART_TYPE_E7)
		emulate_E7_cartridge();
	else if (cart_type == CART_TYPE_DPC)
		emulate_dpc_cartridge(buffer, cart_size_bytes);
	else if (cart_type == CART_TYPE_AR)
		emulate_supercharger_cartridge(cartridge_image_path, cart_size_bytes, buffer, tv_mode);
	else if (cart_type == CART_TYPE_BF)
		emulate_bf_cartridge(cartridge_image_path, cart_size_bytes, buffer);
	else if (cart_type == CART_TYPE_BFSC)
		emulate_bfsc_cartridge(cartridge_image_path, cart_size_bytes, buffer);
	else if (cart_type == CART_TYPE_ACE)
	{
		if(launch_ace_cartridge(cartridge_image_path, BUFFER_SIZE * 1024, buffer))
			set_menu_status_msg("GOOD ACE ROM");
		else
			set_menu_status_msg("BAD ACE FILE");
	}
	else if (cart_type == CART_TYPE_PP) {
		emulate_pp_cartridge(cart_size_bytes, buffer, buffer + 8*1024);
	}
	else if (cart_type == CART_TYPE_DF) {
		emulate_df_cartridge(cartridge_image_path, cart_size_bytes, buffer);
	}
	else if (cart_type == CART_TYPE_DFSC) {
		emulate_dfsc_cartridge(cartridge_image_path, cart_size_bytes, buffer);
	}
	else if (cart_type == CART_TYPE_3EP){
		emulate_3EPlus_cartridge(buffer, cart_size_bytes);
    }

