wjblanke/UnoCart-2600/source/STM32firmware/Atari2600Cart/src/main.c
}

void convertFilenameForCart(unsigned char *dst, char *src)
{
	memset(dst, ' ', 12);
	for (int i=0; i<12; i++) {
		if (!src[i]) break;
		char c = toupper(src[i]);
		dst[i] = c;
	}
}

int readDirectoryForAtari(char *path)
{
	int ret = read_directory(path);
	uint8_t *menu_ram = get_menu_ram();
	// create a table of entries for the atari to read
	memset(menu_ram, 0, 1024);
	for (int i=0; i<num_dir_entries; i++)
	{
		unsigned char *dst = menu_ram + i*12;
		convertFilenameForCart(dst, dir_entries[i].long_filename);
		// set the high-bit of the first character if directory
		if (dir_entries[i].isDir) *dst += 0x80;
	}
	return ret;
}

void bus_dumper() {
	__disable_irq();

	SET_DATA_MODE_IN

	uint16_t addr = ADDR_IN;
	uint32_t start_cycles = 0;

	while (ADDR_IN == addr) start_cycles++;

	for (uint32_t i = 3; i < 32 * 1024; i++)
		((uint16_t*)(CCM_RAM))[i] = (ADDR_IN & 0xffff);

	__enable_irq();

	((uint32_t*)(CCM_RAM))[0] = start_cycles;
	((uint16_t*)(CCM_RAM))[2] = addr;

	FIL file;
	UINT bytes_written;
	FATFS FatFs;

	TM_DELAY_Init();
	f_mount(&FatFs, "", 1);

	f_open(&file, "/bus_dump.bin", FA_CREATE_ALWAYS | FA_WRITE);
	f_write(&file, CCM_RAM, 64 * 1024, &bytes_written);
	f_close(&file);

	f_mount(0, "", 1);

	while (1) {};
}

int main(void)
{
	/* In: PE{0..15} address (A0-A12 on PE0-PE12) */
	config_gpio_addr();
	/* In: Other Cart Input Signals - PC{0..1} */
	config_gpio_sig();
	/* In/Out: PD{8..15} data (D0-D7) */
	config_gpio_data();

	if (!(GPIOC->IDR & 0x0001))
#ifdef BUS_DUMPER
		bus_dumper();
#else
		tv_mode = TV_MODE_PAL60;
#endif
	else if (!(GPIOC->IDR & 0x0002))
		tv_mode = TV_MODE_PAL;
	else
		tv_mode = TV_MODE_NTSC;

	char curPath[256] = "";
	int cart_type = CART_TYPE_NONE;

	// malloc the RAM buffer here in order to avoid zero filling 96k of BSS
	buffer = (uint8_t*)malloc(BUFFER_SIZE * 1024);

	init();

	set_tv_mode(tv_mode);

	// set up status area
	set_menu_status_msg(VERSION);
	set_menu_status_byte(0);

	while (1) {
		int ret = emulate_firmware_cartridge();

		if (ret == CART_CMD_ROOT_DIR)
		{
			curPath[0] = 0;
			if (!readDirectoryForAtari(curPath))
				set_menu_status_msg("CANT READ SD");
		}
		else
		{
			int sel = ret - CART_CMD_SEL_ITEM_n;
			DIR_ENTRY *d = &dir_entries[sel];

			if (d->isDir)
			{	// selection is a directory
				if (!strcmp(d->filename, ".."))
				{	// go back
					int len = strlen(curPath);
					while (len && curPath[--len] != '/');
					curPath[len] = 0;
				}
				else
				{	// go into director
					strcat(curPath, "/");
					strcat(curPath, d->filename);
				}

				if (!readDirectoryForAtari(curPath))
					set_menu_status_msg("CANT READ SD");
				Delayms(200);
			}
			else
			{	// selection is a rom file
				strcpy(cartridge_image_path, curPath);
				strcat(cartridge_image_path, "/");
				strcat(cartridge_image_path, d->filename);
				cart_type = identify_cartridge(cartridge_image_path, d->long_filename);
				Delayms(200);
				if (cart_type != CART_TYPE_NONE)
					emulate_cartridge(cart_type);
				else
					set_menu_status_msg("BAD ROM FILE");
			}
		}
	}
}
